using System;
using System.ComponentModel;
using System.Diagnostics;
using System.Linq;

namespace TE1.Schemas
{
    public enum 검사항목 : Int32
    {
        [Result(), ListBindable(false)] None = 0,

        // 1. Hole
        [Result(검사그룹.치수, 장치구분.Cam01, "H01X")] H01X = 1011,
        [Result(검사그룹.치수, 장치구분.Cam01, "H01Y")] H01Y = 1012,
        [Result(검사그룹.치수, 장치구분.Cam01, "H01D")] H01D = 1013,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H01L")] H01L = 1014,

        [Result(검사그룹.치수, 장치구분.Cam01, "H02X")] H02X = 1021,
        [Result(검사그룹.치수, 장치구분.Cam01, "H02Y")] H02Y = 1022,
        [Result(검사그룹.치수, 장치구분.Cam01, "H02D")] H02D = 1023,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H02L")] H02L = 1024,

        [Result(검사그룹.치수, 장치구분.Cam02, "H03X")] H03X = 1031,
        [Result(검사그룹.치수, 장치구분.Cam02, "H03Y")] H03Y = 1032,
        [Result(검사그룹.치수, 장치구분.Cam02, "H03D")] H03D = 1033,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H03L")] H03L = 1034,

        [Result(검사그룹.치수, 장치구분.Cam02, "H04X")] H04X = 1041,
        [Result(검사그룹.치수, 장치구분.Cam02, "H04Y")] H04Y = 1042,
        [Result(검사그룹.치수, 장치구분.Cam02, "H04D")] H04D = 1043,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H04L")] H04L = 1044,

        [Result(검사그룹.치수, 장치구분.Cam02, "H05X")] H05X = 1051,
        [Result(검사그룹.치수, 장치구분.Cam02, "H05Y")] H05Y = 1052,
        [Result(검사그룹.치수, 장치구분.Cam02, "H05D")] H05D = 1053,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H05L")] H05L = 1054,

        [Result(검사그룹.치수, 장치구분.Cam02, "H06X")] H06X = 1061,
        [Result(검사그룹.치수, 장치구분.Cam02, "H06Y")] H06Y = 1062,
        [Result(검사그룹.치수, 장치구분.Cam02, "H06D")] H06D = 1063,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H06L")] H06L = 1064,

        [Result(검사그룹.치수, 장치구분.Cam02, "H07X")] H07X = 1071,
        [Result(검사그룹.치수, 장치구분.Cam02, "H07Y")] H07Y = 1072,
        [Result(검사그룹.치수, 장치구분.Cam02, "H07D")] H07D = 1073,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H07L")] H07L = 1074,

        [Result(검사그룹.치수, 장치구분.Cam02, "H08X")] H08X = 1081,
        [Result(검사그룹.치수, 장치구분.Cam02, "H08Y")] H08Y = 1082,
        [Result(검사그룹.치수, 장치구분.Cam02, "H08D")] H08D = 1083,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H08L")] H08L = 1084,

        [Result(검사그룹.치수, 장치구분.Cam02, "H09X")] H09X = 1091,
        [Result(검사그룹.치수, 장치구분.Cam02, "H09Y")] H09Y = 1092,
        [Result(검사그룹.치수, 장치구분.Cam02, "H09D")] H09D = 1093,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H09L")] H09L = 1094,

        [Result(검사그룹.치수, 장치구분.Cam02, "H10X")] H10X = 1101,
        [Result(검사그룹.치수, 장치구분.Cam02, "H10Y")] H10Y = 1102,
        [Result(검사그룹.치수, 장치구분.Cam02, "H10D")] H10D = 1103,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H10L")] H10L = 1104,

        [Result(검사그룹.치수, 장치구분.Cam01, "H11X")] H11X = 1111,
        [Result(검사그룹.치수, 장치구분.Cam01, "H11Y")] H11Y = 1112,
        [Result(검사그룹.치수, 장치구분.Cam01, "H11D")] H11D = 1113,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H11L")] H11L = 1114,

        [Result(검사그룹.치수, 장치구분.Cam01, "H12X")] H12X = 1121,
        [Result(검사그룹.치수, 장치구분.Cam01, "H12Y")] H12Y = 1122,
        [Result(검사그룹.치수, 장치구분.Cam01, "H12D")] H12D = 1123,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H12L")] H12L = 1124,

        [Result(검사그룹.치수, 장치구분.Cam01, "H13X")] H13X = 1131,
        [Result(검사그룹.치수, 장치구분.Cam01, "H13Y")] H13Y = 1132,
        [Result(검사그룹.치수, 장치구분.Cam01, "H13D")] H13D = 1133,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H13L")] H13L = 1134,

        [Result(검사그룹.치수, 장치구분.Cam01, "H14X")] H14X = 1141,
        [Result(검사그룹.치수, 장치구분.Cam01, "H14Y")] H14Y = 1142,
        [Result(검사그룹.치수, 장치구분.Cam01, "H14D")] H14D = 1143,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H14L")] H14L = 1144,

        [Result(검사그룹.치수, 장치구분.Cam01, "H15X")] H15X = 1151,
        [Result(검사그룹.치수, 장치구분.Cam01, "H15Y")] H15Y = 1152,
        [Result(검사그룹.치수, 장치구분.Cam01, "H15D")] H15D = 1153,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H15L")] H15L = 1154,

        [Result(검사그룹.치수, 장치구분.Cam01, "H16X")] H16X = 1161,
        [Result(검사그룹.치수, 장치구분.Cam01, "H16Y")] H16Y = 1162,
        [Result(검사그룹.치수, 장치구분.Cam01, "H16D")] H16D = 1163,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H16L")] H16L = 1164,

        [Result(검사그룹.치수, 장치구분.Cam02, "H17X")] H17X = 1171,
        [Result(검사그룹.치수, 장치구분.Cam02, "H17Y")] H17Y = 1172,
        [Result(검사그룹.치수, 장치구분.Cam02, "H17D")] H17D = 1173,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H17L")] H17L = 1174,

        [Result(검사그룹.치수, 장치구분.Cam02, "H18X")] H18X = 1181,
        [Result(검사그룹.치수, 장치구분.Cam02, "H18Y")] H18Y = 1182,
        [Result(검사그룹.치수, 장치구분.Cam02, "H18D")] H18D = 1183,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H18L")] H18L = 1184,

        [Result(검사그룹.치수, 장치구분.Cam01, "H19X")] H19X = 1191,
        [Result(검사그룹.치수, 장치구분.Cam01, "H19Y")] H19Y = 1192,
        [Result(검사그룹.치수, 장치구분.Cam01, "H19D")] H19D = 1193,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H19L")] H19L = 1194,

        [Result(검사그룹.치수, 장치구분.Cam01, "H20X")] H20X = 1201,
        [Result(검사그룹.치수, 장치구분.Cam01, "H20Y")] H20Y = 1202,
        [Result(검사그룹.치수, 장치구분.Cam01, "H20D")] H20D = 1203,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H20L")] H20L = 1204,

        [Result(검사그룹.치수, 장치구분.Cam01, "H21X")] H21X = 1211,
        [Result(검사그룹.치수, 장치구분.Cam01, "H21Y")] H21Y = 1212,
        [Result(검사그룹.치수, 장치구분.Cam01, "H21D")] H21D = 1213,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H21L")] H21L = 1214,

        [Result(검사그룹.치수, 장치구분.Cam01, "H22X")] H22X = 1221,
        [Result(검사그룹.치수, 장치구분.Cam01, "H22Y")] H22Y = 1222,
        [Result(검사그룹.치수, 장치구분.Cam01, "H22D")] H22D = 1223,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H22L")] H22L = 1224,

        [Result(검사그룹.치수, 장치구분.Cam01, "H23X")] H23X = 1231,
        [Result(검사그룹.치수, 장치구분.Cam01, "H23Y")] H23Y = 1232,
        [Result(검사그룹.치수, 장치구분.Cam01, "H23D")] H23D = 1233,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H23L")] H23L = 1234,

        [Result(검사그룹.치수, 장치구분.Cam01, "H24X")] H24X = 1241,
        [Result(검사그룹.치수, 장치구분.Cam01, "H24Y")] H24Y = 1242,
        [Result(검사그룹.치수, 장치구분.Cam01, "H24D")] H24D = 1243,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H24L")] H24L = 1244,

        [Result(검사그룹.치수, 장치구분.Cam01, "H25X")] H25X = 1251,
        [Result(검사그룹.치수, 장치구분.Cam01, "H25Y")] H25Y = 1252,
        [Result(검사그룹.치수, 장치구분.Cam01, "H25D")] H25D = 1253,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H25L")] H25L = 1254,

        [Result(검사그룹.치수, 장치구분.Cam01, "H26X")] H26X = 1261,
        [Result(검사그룹.치수, 장치구분.Cam01, "H26Y")] H26Y = 1262,
        [Result(검사그룹.치수, 장치구분.Cam01, "H26D")] H26D = 1263,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H26L")] H26L = 1264,

        [Result(검사그룹.치수, 장치구분.Cam01, "H27X")] H27X = 1271,
        [Result(검사그룹.치수, 장치구분.Cam01, "H27Y")] H27Y = 1272,
        [Result(검사그룹.치수, 장치구분.Cam01, "H27D")] H27D = 1273,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H27L")] H27L = 1274,

        [Result(검사그룹.치수, 장치구분.Cam01, "H28X")] H28X = 1281,
        [Result(검사그룹.치수, 장치구분.Cam01, "H28Y")] H28Y = 1282,
        [Result(검사그룹.치수, 장치구분.Cam01, "H28D")] H28D = 1283,
        //[Result(검사그룹.치수, 장치구분.Cam01, "H28L")] H28L = 1284,

        // B Datum
        [Result(검사그룹.치수, 장치구분.Cam02, "H37X")] H37X = 1371,
        [Result(검사그룹.치수, 장치구분.Cam02, "H37Y")] H37Y = 1372,
        [Result(검사그룹.치수, 장치구분.Cam02, "H37D")] H37D = 1373,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H37L")] H37L = 1374,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H37P")] H37P = 1375, //위치도 사실 상 0

        // C Datum
        [Result(검사그룹.치수, 장치구분.Cam02, "H38X")] H38X = 1381,
        [Result(검사그룹.치수, 장치구분.Cam02, "H38Y")] H38Y = 1382,
        [Result(검사그룹.치수, 장치구분.Cam02, "H38D")] H38D = 1383,
        //[Result(검사그룹.치수, 장치구분.Cam02, "H38L")] H38L = 1384,

        // Rectangle
        [Result(검사그룹.치수, 장치구분.Cam02, "R01X")] R01X = 1801,
        [Result(검사그룹.치수, 장치구분.Cam02, "R01Y")] R01Y = 1802,
        [Result(검사그룹.치수, 장치구분.Cam02, "R01W")] R01W = 1803,
        [Result(검사그룹.치수, 장치구분.Cam02, "R01L")] R01L = 1804,

        // 2. Trim
        [Result(검사그룹.치수, 장치구분.Cam02, "T101")] T101 = 2101,
        [Result(검사그룹.치수, 장치구분.Cam02, "T103")] T103 = 2103,
        [Result(검사그룹.치수, 장치구분.Cam02, "T105")] T105 = 2105,
        [Result(검사그룹.치수, 장치구분.Cam02, "T107")] T107 = 2107,
        [Result(검사그룹.치수, 장치구분.Cam02, "T109")] T109 = 2109,
        [Result(검사그룹.치수, 장치구분.Cam02, "T111")] T111 = 2111,
        [Result(검사그룹.치수, 장치구분.Cam02, "T113")] T113 = 2113,
        [Result(검사그룹.치수, 장치구분.Cam02, "T115")] T115 = 2115,
        [Result(검사그룹.치수, 장치구분.Cam02, "T117")] T117 = 2117,
        [Result(검사그룹.치수, 장치구분.Cam02, "T119")] T119 = 2119,
        [Result(검사그룹.치수, 장치구분.Cam03, "T201")] T201 = 2201,
        [Result(검사그룹.치수, 장치구분.Cam03, "T203")] T203 = 2203,
        [Result(검사그룹.치수, 장치구분.Cam03, "T205")] T205 = 2205,
        [Result(검사그룹.치수, 장치구분.Cam03, "T207")] T207 = 2207,
        [Result(검사그룹.치수, 장치구분.Cam03, "T209")] T209 = 2209,
        [Result(검사그룹.치수, 장치구분.Cam03, "T210")] T210 = 2210,
        [Result(검사그룹.치수, 장치구분.Cam03, "T211")] T211 = 2211,
        [Result(검사그룹.치수, 장치구분.Cam03, "T212")] T212 = 2212,
        [Result(검사그룹.치수, 장치구분.Cam03, "T213")] T213 = 2213,
        [Result(검사그룹.치수, 장치구분.Cam03, "T214")] T214 = 2214,
        [Result(검사그룹.치수, 장치구분.Cam03, "T216")] T216 = 2216,
        [Result(검사그룹.치수, 장치구분.Cam03, "T218")] T218 = 2218,
        [Result(검사그룹.치수, 장치구분.Cam03, "T220")] T220 = 2220,
        [Result(검사그룹.치수, 장치구분.Cam03, "T222")] T222 = 2222,
        [Result(검사그룹.치수, 장치구분.Cam03, "T301")] T301 = 2301,
        [Result(검사그룹.치수, 장치구분.Cam03, "T302")] T302 = 2302,
        [Result(검사그룹.치수, 장치구분.Cam03, "T303")] T303 = 2303,
        [Result(검사그룹.치수, 장치구분.Cam03, "T304")] T304 = 2304,
        [Result(검사그룹.치수, 장치구분.Cam03, "T401")] T401 = 2401,
        [Result(검사그룹.치수, 장치구분.Cam03, "T402")] T402 = 2402,
        [Result(검사그룹.치수, 장치구분.Cam03, "T403")] T403 = 2403,
        [Result(검사그룹.치수, 장치구분.Cam03, "T404")] T404 = 2404,
        [Result(검사그룹.치수, 장치구분.Cam03, "T501")] T501 = 2501,
        [Result(검사그룹.치수, 장치구분.Cam03, "T503")] T503 = 2503,
        [Result(검사그룹.치수, 장치구분.Cam03, "T504")] T504 = 2504,
        [Result(검사그룹.치수, 장치구분.Cam03, "T505")] T505 = 2505,
        [Result(검사그룹.치수, 장치구분.Cam03, "T601")] T601 = 2601,
        [Result(검사그룹.치수, 장치구분.Cam03, "T602")] T602 = 2602,
        [Result(검사그룹.치수, 장치구분.Cam03, "T603")] T603 = 2603,
        [Result(검사그룹.치수, 장치구분.Cam03, "T604")] T604 = 2604,
        [Result(검사그룹.치수, 장치구분.Cam03, "T701")] T701 = 2701,
        [Result(검사그룹.치수, 장치구분.Cam03, "T702")] T702 = 2702,
        [Result(검사그룹.치수, 장치구분.Cam03, "T703")] T703 = 2703,
        [Result(검사그룹.치수, 장치구분.Cam03, "T705")] T705 = 2705,
        [Result(검사그룹.치수, 장치구분.Cam03, "T706")] T706 = 2706,
        [Result(검사그룹.치수, 장치구분.Cam03, "T707")] T707 = 2707,
        [Result(검사그룹.치수, 장치구분.Cam03, "T801")] T801 = 2801,
        [Result(검사그룹.치수, 장치구분.Cam03, "T803")] T803 = 2803,
        [Result(검사그룹.치수, 장치구분.Cam03, "T804")] T804 = 2804,
        [Result(검사그룹.치수, 장치구분.Cam03, "T806")] T806 = 2806,
        [Result(검사그룹.치수, 장치구분.Cam03, "T807")] T807 = 2807,
        [Result(검사그룹.치수, 장치구분.Cam03, "T808")] T808 = 2808,

        // 3. Bolt

        // 4. Mica

        // 5. Flatness
        [Result(검사그룹.치수, 장치구분.Flatness, "F01")] F01 = 5010,
        [Result(검사그룹.치수, 장치구분.Flatness, "F02")] F02 = 5020,
        [Result(검사그룹.치수, 장치구분.Flatness, "F03")] F03 = 5030,
        [Result(검사그룹.치수, 장치구분.Flatness, "F04")] F04 = 5040,
        [Result(검사그룹.치수, 장치구분.Flatness, "F05")] F05 = 5050,
        [Result(검사그룹.치수, 장치구분.Flatness, "F06")] F06 = 5060,
        [Result(검사그룹.치수, 장치구분.Flatness, "F07")] F07 = 5070,
        [Result(검사그룹.치수, 장치구분.Flatness, "F08")] F08 = 5080,

        // 6. Thickness
        [Result(검사그룹.치수, 장치구분.Thickness)] Thickness = 6010,

        // 8. Surface
        [Result(검사그룹.표면, 장치구분.Cameras)] Surface = 8010,
        // 9. Others
        [Result(검사그룹.표면, 장치구분.QrReader)] QrLegibility = 9010,
        [Result(검사그룹.표면, 장치구분.QrReader)] Imprinted = 9020,
    }
}
